RT-Thread/rt-thread/bsp/fm33lc026/libraries/FM33LC0xx_FL_Driver/Inc/fm33lc0xx_fl_rtc.h
/**
  *******************************************************************************************************
  * @file    fm33lc0xx_fl_rtc.h
  * @author  FMSH Application Team
  * @brief   Head file of RTC FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LC0XX_FL_RTC_H
#define __FM33LC0XX_FL_RTC_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lc0xx_fl.h"
/** @addtogroup FM33LC0XX_FL_Driver
  * @{
  */

/** @defgroup RTC RTC
  * @brief RTC FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup RTC_FL_ES_INIT RTC Exported Init structures
  * @{
  */

/**
  * @brief Configuration with temporary structure variable users will not be used directly
  */
typedef struct
{
    __IO uint32_t backup[7];
} FL_RTC_Backup_ADDR;

/**
  * @brief RTC Init Sturcture definition
  */
typedef struct
{
    /** 年 */
    uint32_t year;
    /** 月 */
    uint32_t month;
    /** 日 */
    uint32_t day;
    /** 周 */
    uint32_t week;
    /** 时 */
    uint32_t hour;
    /** 分 */
    uint32_t minute;
    /** 秒 */
    uint32_t second;

} FL_RTC_InitTypeDef;

/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup RTC_FL_Exported_Constants RTC Exported Constants
  * @{
  */

#define    RTC_IER_ADJ_IE_Pos                                     (12U)
#define    RTC_IER_ADJ_IE_Msk                                     (0x1U << RTC_IER_ADJ_IE_Pos)
#define    RTC_IER_ADJ_IE                                         RTC_IER_ADJ_IE_Msk

#define    RTC_IER_ALARM_IE_Pos                                   (11U)
#define    RTC_IER_ALARM_IE_Msk                                   (0x1U << RTC_IER_ALARM_IE_Pos)
#define    RTC_IER_ALARM_IE                                       RTC_IER_ALARM_IE_Msk

#define    RTC_IER_1KHZ_IE_Pos                                    (10U)
#define    RTC_IER_1KHZ_IE_Msk                                    (0x1U << RTC_IER_1KHZ_IE_Pos)
#define    RTC_IER_1KHZ_IE                                        RTC_IER_1KHZ_IE_Msk

#define    RTC_IER_256HZ_IE_Pos                                   (9U)
#define    RTC_IER_256HZ_IE_Msk                                   (0x1U << RTC_IER_256HZ_IE_Pos)
#define    RTC_IER_256HZ_IE                                       RTC_IER_256HZ_IE_Msk

#define    RTC_IER_64HZ_IE_Pos                                    (8U)
#define    RTC_IER_64HZ_IE_Msk                                    (0x1U << RTC_IER_64HZ_IE_Pos)
#define    RTC_IER_64HZ_IE                                        RTC_IER_64HZ_IE_Msk

#define    RTC_IER_16HZ_IE_Pos                                    (7U)
#define    RTC_IER_16HZ_IE_Msk                                    (0x1U << RTC_IER_16HZ_IE_Pos)
#define    RTC_IER_16HZ_IE                                        RTC_IER_16HZ_IE_Msk

#define    RTC_IER_8HZ_IE_Pos                                     (6U)
#define    RTC_IER_8HZ_IE_Msk                                     (0x1U << RTC_IER_8HZ_IE_Pos)
#define    RTC_IER_8HZ_IE                                         RTC_IER_8HZ_IE_Msk

#define    RTC_IER_4HZ_IE_Pos                                     (5U)
#define    RTC_IER_4HZ_IE_Msk                                     (0x1U << RTC_IER_4HZ_IE_Pos)
#define    RTC_IER_4HZ_IE                                         RTC_IER_4HZ_IE_Msk

#define    RTC_IER_2HZ_IE_Pos                                     (4U)
#define    RTC_IER_2HZ_IE_Msk                                     (0x1U << RTC_IER_2HZ_IE_Pos)
#define    RTC_IER_2HZ_IE                                         RTC_IER_2HZ_IE_Msk

#define    RTC_IER_SEC_IE_Pos                                     (3U)
#define    RTC_IER_SEC_IE_Msk                                     (0x1U << RTC_IER_SEC_IE_Pos)
#define    RTC_IER_SEC_IE                                         RTC_IER_SEC_IE_Msk

#define    RTC_IER_MIN_IE_Pos                                     (2U)
#define    RTC_IER_MIN_IE_Msk                                     (0x1U << RTC_IER_MIN_IE_Pos)
#define    RTC_IER_MIN_IE                                         RTC_IER_MIN_IE_Msk

#define    RTC_IER_HOUR_IE_Pos                                    (1U)
#define    RTC_IER_HOUR_IE_Msk                                    (0x1U << RTC_IER_HOUR_IE_Pos)
#define    RTC_IER_HOUR_IE                                        RTC_IER_HOUR_IE_Msk

#define    RTC_IER_DAY_IE_Pos                                     (0U)
#define    RTC_IER_DAY_IE_Msk                                     (0x1U << RTC_IER_DAY_IE_Pos)
#define    RTC_IER_DAY_IE                                         RTC_IER_DAY_IE_Msk

#define    RTC_ISR_ADJ_IF_Pos                                     (12U)
#define    RTC_ISR_ADJ_IF_Msk                                     (0x1U << RTC_ISR_ADJ_IF_Pos)
#define    RTC_ISR_ADJ_IF                                         RTC_ISR_ADJ_IF_Msk

#define    RTC_ISR_ALARM_IF_Pos                                   (11U)
#define    RTC_ISR_ALARM_IF_Msk                                   (0x1U << RTC_ISR_ALARM_IF_Pos)
#define    RTC_ISR_ALARM_IF                                       RTC_ISR_ALARM_IF_Msk

